app/controllers/events_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 65], ["LIMIT", 1]]
---
  def new
  	@user = User.find_by(id: session[:user_id])

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 65], ["LIMIT", 1]]
INSERT INTO "events" ("description", "date", "place", "created_at", "updated_at", "creator_id") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
  	@user = User.find_by(id: session[:user_id])
  	@event = Event.new(event_params)
  	@event.creator_id = @user.id
    @event.save

SELECT "events".* FROM "events"
---
  def index
    @event = Event.new
    @events = Event.all