app/controllers/sessions_controller.rb

  def create
  	user = User.find_by(id: params[:session][:user_id].to_i)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]