app/controllers/users_controller.rb

  def show
    @user = User.find(params[:id])
    @event = Event.new
    @events = Event.where(creator_id: @user.id)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 56], ["LIMIT", 1]]
SELECT "events".* FROM "events" WHERE "events"."creator_id" = ?  [["creator_id", 65]]

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "paul"], ["created_at", "2018-05-03 17:42:05.038090"], ["updated_at", "2018-05-03 17:42:05.038090"]]